# PeerConnectionType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsComponentConnection..::..PeerConnectionType Property
StairsComponentConnection Class See Also
---
The connection type of the peer connected stairs component.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public StairsComponentConnectionEndType PeerConnectionType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PeerConnectionType As StairsComponentConnectionEndType
	Get
```

Visual C++
---
```text
public:
property StairsComponentConnectionEndType PeerConnectionType {
	StairsComponentConnectionEndType get ();
}
```

# See Also
StairsComponentConnection Class
Autodesk.Revit.DB.Architecture Namespace